Revit 2027 API
RebarCrankOverridableParameters.GetCrankEndAngledLengthFormulaParams Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCrankEndAngledLengthFormulaParams()
Public Function GetCrankEndAngledLengthFormulaParams As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCrankEndAngledLengthFormulaParams()
member GetCrankEndAngledLengthFormulaParams : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace